tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/polyMesh/blockMeshDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

convertToMeters 1;

vertices
(
    (-0.3 0   -0.3)
    ( 0.3 0   -0.3)
    ( 0.3 1.0 -0.3)
    (-0.3 1.0 -0.3)
    (-0.3 0    0.3)
    ( 0.3 0    0.3)
    ( 0.3 1.0  0.3)
    (-0.3 1.0  0.3)

);

blocks
(
    hex (0 1 2 3 4 5 6 7) (70 70 70) simpleGrading (1 1 1)
);

edges
(
);

patches
(
    patch base 
    (
        (0 1 5 4)
    )
    patch outlet
    (
        (3 2 6 7)
    )
    patch sides
    (
        (0 4 7 3)
        (0 1 2 3)
        (1 5 6 2)
        (4 5 6 7)
    )
);

mergePatchPairs
(
);

// ************************************************************************* //
