tutorials/combustion/fireFoam/les/smallPoolFire3D/constant/polyMesh/boundary
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7.x                                 |
|   \\  /    A nd           | Web:      www.OpenFOAM.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       polyBoundaryMesh;
    location    "constant/polyMesh";
    object      boundary;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

4
(
    base
    {
        type            patch;
        nFaces          4704;
        startFace       1014300;
    }
    outlet
    {
        type            patch;
        nFaces          4900;
        startFace       1019004;
    }
    sides
    {
        type            patch;
        nFaces          19600;
        startFace       1023904;
    }
    inlet
    {
        type            patch;
        nFaces          196;
        startFace       1043504;
    }
)

// ************************************************************************* //
