tutorials/combustion/fireFoam/les/smallPoolFire3D/0/k
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  1.7                                   |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       volScalarField;
    location    "0";
    object      k;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

dimensions      [0 2 -2 0 0 0 0];

internalField   uniform 1e-4;

boundaryField
{
    outlet
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 1e-4;
    }
    sides
    {
        type            inletOutlet;
        inletValue      uniform 1e-4;
        value           uniform 1e-4;
    }
    base
    {
        type            zeroGradient;
    }
    inlet
    {
        type            fixedValue;
        value           uniform 1e-4;
    }

}


// ************************************************************************* //
